In [2]:
import pandas as pd
import numpy as np

### 연습 문제 1

#### 1) 임의로 두 개의 시리즈 객체를 만든다.
모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [21]:
a = pd.Series(np.random.randint(10, size = 6), index=['a','b','c','d','e','f'])
b = pd.Series(np.random.randint(10, size = 6), index=['a','b','c','d','e','f'])
print(a)
print(b)

a    2
b    4
c    8
d    5
e    4
f    4
dtype: int32
a    8
b    6
c    5
d    3
e    4
f    5
dtype: int32

#### 2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [22]:
a + b

a    10
b    10
c    13
d     8
e     8
f     9
dtype: int32

In [23]:
a - b

a   -6
b   -2
c    3
d    2
e    0
f   -1
dtype: int32

In [24]:
a * b

a    16
b    24
c    40
d    15
e    16
f    20
dtype: int32

In [25]:
a / b

a    0.250000
b    0.666667
c    1.600000
d    1.666667
e    1.000000
f    0.800000
dtype: float64

### 연습 문제 2
1) 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.  
- 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
- 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [26]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

### 연습 문제 3
다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [72]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [73]:
df['영어']

춘향    90
몽룡    70
향단    60
방자    40
Name: 영어, dtype: int64

2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [74]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [75]:
df['평균'] = df.sum(axis = 1)/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [78]:
df['영어']['방자'] = 80
df

C:\Users\Q\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  46.666667

In [83]:
df["평균"] = df.sum(axis = 1)/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

5) 춘향의 점수를 데이터프레임으로 나타낸다.

In [88]:
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

6) 향단의 점수를 시리즈로 나타낸다.

In [90]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### 연습 문제 4
1) 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

In [94]:
df = pd.DataFrame(np.array(np.random.randint(10, size = 25))
                  .reshape(5, 5), index = ['a','b','c','d','e'], columns=['A','B','C','D','E'])
df

   A  B  C  D  E
a  8  9  9  5  5
b  2  5  9  0  3
c  1  4  8  3  7
d  4  6  2  2  3
e  4  0  5  3  8

2) 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [125]:
#1 columns A
df['A']

a    8
b    2
c    1
d    4
e    4
Name: A, dtype: int32

In [126]:
#2 row 1
df[:1]

   A  B  C  D  E
a  8  9  9  5  5

In [127]:
#3 columns A and C
df[['A','C']]

   A  C
a  8  9
b  2  9
c  1  8
d  4  2
e  4  5

In [128]:
#4 row b
df.loc['b']

A    2
B    5
C    9
D    0
E    3
Name: b, dtype: int32

In [129]:
#5 columns A
df.A

a    8
b    2
c    1
d    4
e    4
Name: A, dtype: int32

In [131]:
#6 row 3 and End
df.iloc[3:]

   A  B  C  D  E
d  4  6  2  2  3
e  4  0  5  3  8

In [134]:
#7 row 0 and 1, columns 1 and 3
df.iloc[0:2, 1:4]

   B  C  D
a  9  9  5
b  5  9  0

In [141]:
#8 columns A > 2
df.A > 2

a     True
b    False
c    False
d     True
e     True
Name: A, dtype: bool

In [140]:
#9 columns A > 2
df.loc[df.A > 2]

   A  B  C  D  E
a  8  9  9  5  5
d  4  6  2  2  3
e  4  0  5  3  8

In [143]:
#10 columns -2:
df.iloc[0, -2:]

D    5
E    5
Name: a, dtype: int32

### 연습 문제 5
다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다.  
이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

In [147]:
import seaborn as sns
titanic = sns.load_dataset("titanic")

1) 타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [170]:
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

2) 타이타닉호 승객중  
성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [149]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [153]:
titanic.age.value_counts().sort_index().tail(10)

62.0    4
63.0    2
64.0    2
65.0    3
66.0    1
70.0    2
70.5    1
71.0    2
74.0    1
80.0    1
Name: age, dtype: int64

In [156]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [157]:
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

3) 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해  
'미성년자', '청년', '중년', '장년', '노년' 승객의 비율을 구한다.  
각 그룹 별로 비율의 전체 합은 1이 되어야 한다.

In [168]:
bins = [1, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [175]:
titanic_alive = titanic[titanic.alive == 'yes']['age']
titanic_dead = titanic[titanic.alive == 'no']['age']
print(titanic_alive.head())
print(titanic_dead.head())

1    38.0
2    26.0
3    35.0
8    27.0
9    14.0
Name: age, dtype: float64
0    22.0
4    35.0
5     NaN
6    54.0
7     2.0
Name: age, dtype: float64

In [188]:
alive = pd.cut(titanic_alive, bins, labels = labels)
#alive.dropna(inplace = True)
dead = pd.cut(titanic_dead, bins, labels = labels)
#dead.dropna(inplace = True)
print(alive.head())
print('Alive : ', alive.count())
print(dead.head())
print('Dead : ', dead.count())

1      장년
2      중년
3      중년
8      중년
9    미성년자
Name: age, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]
Alive :  278
0      청년
4      중년
5     NaN
6      장년
7    미성년자
Name: age, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]
Dead :  422

In [186]:
print(pd.value_counts(alive))
print(pd.value_counts(alive)/sum(pd.value_counts(alive)))

중년      83
장년      78
청년      75
미성년자    37
노년       5
Name: age, dtype: int64
중년      0.298561
장년      0.280576
청년      0.269784
미성년자    0.133094
노년      0.017986
Name: age, dtype: float64

In [187]:
print(pd.value_counts(dead))
print(pd.value_counts(dead)/sum(pd.value_counts(dead)))

청년      143
장년      117
중년      113
미성년자     32
노년       17
Name: age, dtype: int64
청년      0.338863
장년      0.277251
중년      0.267773
미성년자    0.075829
노년      0.040284
Name: age, dtype: float64